
// include.h
//============================================================================//
// 更新：02/06/24(月)
// 概要：なし。
// 補足：なし。
//============================================================================//

#ifndef __include_h__
#define __include_h__

/******************************************************************************/
//		インクルード
/******************************************************************************/

#define  APP_NAME  "mp3album"


/******************************************************************************/
//		インクルード
/******************************************************************************/

#pragma warning( disable : 4786 )   // C4786なんて表示すんな( ﾟДﾟ)ｺﾞﾙｧ
#include <windows.h>
#include <string>
#include <vector>
#include <commctrl.h>
#include <mbstring.h>
#include <sys/stat.h>
#include <time.h>
#include <shlobj.h>

using namespace std ;

#endif