
// main.cpp
//============================================================================//
// 更新：02/12/07(土)
// 概要：なし。
// 補足：なし。
//============================================================================//

#include "include.h"
#include "resource.h"
#include "ZipDlg.h"


/******************************************************************************/
// WinMain
//============================================================================//
// 更新：02/06/23(日)
// 概要：なし。
// 補足：なし。
//============================================================================//

int WINAPI WinMain( HINSTANCE hInst, HINSTANCE, LPSTR, int i)
{
	ZipDlg zd ;
	DialogBoxParam( hInst, MAKEINTRESOURCE( IDD_MAIN), NULL, ZipDlgProc, (LPARAM)&zd) ;
	return 0 ;
}


/******************************************************************************/
// 出力用関数
//============================================================================//
// 更新：02/04/09(火)
// 概要：メッセージマップを記述する為の基本マクロ。
// 補足：なし。
//============================================================================//

void MyOutputDebugString( LPCSTR pszFormat, ...)
{
    va_list    argp;
    char pszBuf[ 256];
    va_start(argp, pszFormat);
    vsprintf( pszBuf, pszFormat, argp);
    va_end(argp);
    OutputDebugString( pszBuf);
}
